package com.panda.batch;

public class batch2 {
}
/*
Response: {"res":"香港恒藝騰信息科技有限公司,20240413980070：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
西安展梦跨境电商有限公司,20240413980156：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
石家庄江睿焱商贸有限公司,20240309980009：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
广州汉宋进出口贸易有限公司,20240413980020：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
大连拓津科技有限公司,20240413980031：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
张德勇,20240413980029：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
珠海美臻科技有限公司,20240413980030：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
安吉德澜家具有限公司,20240413980018：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
史峰,20240413980015：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市爱泊优科技有限公司,20240413980056：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市亿鸿通科技有限公司,20240413980065：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
四卒礼品有限公司,20240413980003：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
北京鸿达电子商务有限公司,20240413980016：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
青岛塔波尔家进出口有限公司,20240413980051：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市鑫文商贸有限公司,20240413980064：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
南京华景旅游用品有限公司,20240413980039：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
安徽省华景旅游用品有限公司,20240413980017：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
啟帆贸易有限公司,20240321980015：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市宸宁贸易有限公司,20240413980108：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市搏锐科技有限公司,20240413980057：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市欢乐树科技有限公司,20240413980113：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
石家庄优加博贸易有限公司,20240413980002：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市极腾网络科技有限公司,20240413980061：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
广州易享电子商务有限公司,20240413980049：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市环球一百电子商务有限公司,20240413980060：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳突鹿创新有限公司,20240413980155：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
东莞市豪坤贸易有限公司,20240413980045：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
常德格博斯网络科技有限公司,20240413980043：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
汕头市库克罗普斯科技有限公司,20240413980023：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
东莞市珍实好电子商务有限公司,20240413980078：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市超星科技有限公司,20240321980011：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
石家庄品腾商贸有限公司,20240413980068：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
美宙科技（深圳）有限公司,20240413980130：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳神谷科技有限公司,20240413980153：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
逸美科技（深圳）有限公司,20240413980157：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
河北响当当商贸有限公司,20240413980161：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
浦江曹科贸易有限公司,20240417980001：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
浦江县陈先萍电子商务有限公司,20240417980002：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
浦江县霞帛电子商务有限公司,20240413980142：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
杨思雨,20250209000734：利用者識別番号を入力してください。
广州市吉慕亚商贸有限公司,20240309980008：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
广州惠未来科技有限公司,20240309980006：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
TIFFCO.,LIMITED,20240413980159：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
张灵辉,20250210000263：利用者識別番号を入力してください。
常州壹拾国际贸易有限公司,20230326000036：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市洛酷信息科技有限公司,20240413980138：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市顺业电子商务有限公司,20240422980003：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳盈飞利电子商务有限公司,20240422980004：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
北京东方环球科贸有限公司,20240413980162：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市运通天下科技有限公司,20240413980139：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市璞华科技有限公司,20240413980025：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
杭州乐卓商贸有限公司,20240413980089：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
东莞市数联线缆有限公司,20240413980160：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
刘华珍,20250213000798：利用者識別番号を入力してください。
杭州简屹进出口有限公司,20240413980088：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳凯锐海外贸易有限公司,20240413980055：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
常州路达曼智能科技有限公司,20240309980010：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳乐军国际贸易有限公司,20240413980106：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
深圳市名娟盛商贸有限公司,20240413980119：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
广州隆奇贸易有限公司,20250213000841：利用者識別番号を入力してください。
深圳市新喜科技有限公司,20240413980040：利用者識別番号が廃止されています。確認の上、再度入力してください。正しい利用者識別番号が分からない場合は、所轄の税務署に確認してください。
CheckEtaxNo件数：407
"}


SELECT
    pdsks.PDSK AS 查询条件,
    teai.*
FROM
    (
        SELECT 'PDSK240099' AS PDSK
        UNION ALL SELECT 'PDSK240046'
        UNION ALL SELECT 'PDSK240093'
        UNION ALL SELECT 'PDSK240106'
        UNION ALL SELECT 'PDSK240109'
        UNION ALL SELECT 'PDSK240113'
        UNION ALL SELECT 'PDSK240072'
        UNION ALL SELECT 'PDSK240103'
        UNION ALL SELECT 'PDSK240051'
        UNION ALL SELECT 'PDSK240041'
        UNION ALL SELECT 'PDSK240080'
        UNION ALL SELECT 'PDSK240108'
        UNION ALL SELECT 'PDSK240077'
        UNION ALL SELECT 'PDSK240048'
        UNION ALL SELECT 'PDSK240067'
        UNION ALL SELECT 'PDSK240029'
        UNION ALL SELECT 'PDSK240070'
        UNION ALL SELECT 'PDSK240098'
        UNION ALL SELECT 'PDSK240117'
        UNION ALL SELECT 'PDSK240095'
        UNION ALL SELECT 'PDSK240114'
        UNION ALL SELECT 'PDSK240042'
        UNION ALL SELECT 'PDSK240100'
        UNION ALL SELECT 'PDSK240073'
        UNION ALL SELECT 'PDSK240065'
        UNION ALL SELECT 'PDSK240115'
        UNION ALL SELECT 'PDSK240104'
        UNION ALL SELECT 'PDSK240094'
        UNION ALL SELECT 'PDSK240084'
        UNION ALL SELECT 'PDSK240064'
        UNION ALL SELECT 'PDSK240112'
        UNION ALL SELECT 'PDSK240068'
        UNION ALL SELECT 'PDSK240105'
        UNION ALL SELECT 'PDSK240071'
        UNION ALL SELECT 'PDSK240050'
        UNION ALL SELECT 'PDSK240074'
        UNION ALL SELECT 'PDSK240069'
        UNION ALL SELECT 'PDSK240062'
        UNION ALL SELECT 'PDSK240043'
        UNION ALL SELECT 'PDSK240096'
        UNION ALL SELECT 'PDSK240075'
        UNION ALL SELECT 'PDSK240110'
        UNION ALL SELECT 'PDSK240086'
        UNION ALL SELECT 'PDSK240097'
        UNION ALL SELECT 'PDSK240047'
        UNION ALL SELECT 'PDSK240107'
        UNION ALL SELECT 'PDSK240101'
        UNION ALL SELECT 'PDSK240087'
        UNION ALL SELECT 'PDSK240066'
        UNION ALL SELECT 'PDSK240049'
        UNION ALL SELECT 'PDSK240076'
    ) pdsks
LEFT JOIN t_xiaofeishui_shengao txs
    ON pdsks.PDSK = txs.PDSK

    LEFT JOIN t_etax_account_info teai
        ON teai.yyyymmdd_count = txs.yyyymmdd_count

***************************



SELECT
    teai.yyyymmdd_count
    , txs.PDSK
    , teai.CompanyName_English
    , (
        SELECT
            GROUP_CONCAT(
                CONCAT(
                    PDSK
                    , '_'
                    , activation_code
                    , '_'
                    , IFNULL(NULLIF(TRIM(shuilishi_id), ''), '税理士ID')
                ) SEPARATOR ','
            )
        FROM
            t_xiaofeishui_shengao txs
        where
            teai.yyyymmdd_count = txs.yyyymmdd_count
    ) AS txs_PDSK
FROM
    t_etax_account_info teai
    INNER JOIN t_xiaofeishui_shengao txs
        ON teai.yyyymmdd_count = txs.yyyymmdd_count
        AND txs.yyyy = '2024'
        AND txs.activation_code LIKE '激活完了pdf%'
where
    txs.PDSK
  in (
 "PDSK240049"
,"PDSK240064"
,"PDSK240065"
,"PDSK240066"
,"PDSK240067"
,"PDSK240068"
,"PDSK240069"
,"PDSK240070"
,"PDSK240071"
,"PDSK240072"
,"PDSK240073"
,"PDSK240074"
,"PDSK240075"
,"PDSK240077"
,"PDSK240080"
,"PDSK240084"
,"PDSK240086"
,"PDSK240087"
,"PDSK240088"
,"PDSK240089"
,"PDSK240090"
,"PDSK240091"
,"PDSK240092"
,"PDSK240093"
,"PDSK240094"
,"PDSK240095"
,"PDSK240096"
,"PDSK240097"
,"PDSK240098"
,"PDSK240099"
,"PDSK240101"
,"PDSK240103"
,"PDSK240105"
,"PDSK240108"
,"PDSK240109"
,"PDSK240110"
,"PDSK240111"
,"PDSK240112"
,"PDSK240113"
,"PDSK240114"
,"PDSK240115"
,"PDSK240116"
,"PDSK240117"
,"PDSK240118"
,"PDSK240119"
,"PDSK240120"
,"PDSK240121"
,"PDSK240122"
,"PDSK240123"
,"PDSK240124"
,"PDSK240127"
,"PDSK240128"
,"PDSK240130"
,"PDSK240131"
,"PDSK240133"
,"PDSK240135"
,"PDSK240136"
,"PDSK240137"
,"PDSK240138"
,"PDSK240139"
,"PDSK240140"
,"PDSK240141"
,"PDSK240142"
,"PDSK240143"
,"PDSK240144"
,"PDSK240149"
,"PDSK240150"
,"PDSK240151"
,"PDSK240156"
,"PDSK240157"
,"PDSK240158"
,"PDSK240160"
,"PDSK240161"
,"PDSK240162"
,"PDSK240163"
,"PDSK240164"
,"PDSK240165"
,"PDSK240167"
,"PDSK240170"
,"PDSK240171"
,"PDSK240173"
,"PDSK240174"
,"PDSK240176"
,"PDSK240177"
,"PDSK240178"
,"PDSK240180"
,"PDSK240182"
,"PDSK240213"
,"PDSK240216"
,"PDSK240224"
,"PDSK240231"
,"PDSK240234"
,"PDSK240237"
,"PDSK240240"
,"PDSK240241"
,"PDSK240242"
,"PDSK240243"
,"PDSK240244"
,"PDSK240246"
,"PDSK240250"
,"PDSK240258"
,"PDSK240263"
,"PDSK240265"
,"PDSK240273"
)



ORDER BY
    txs_PDSK asc





*/